DataProcessors/ИА_КСУ_ИЦО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_КСУ_ИЦО</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ИА_ПериодыДетализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПериодыДетализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ВариантыПолученияДанныхСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыПолученияДанныхСтатистик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументомСтатистика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИА_КСУ_ИЦО/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ФормаСтатистик, ЭтоВеб, ID_Постов;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если не ИА_Защита_Общий.ЛицензияДоступна("Статистика") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	Если не Организация1.Пустая() Тогда
		Организация = Организация1;
	КонецЕсли;
	
	//статистики
	ДатаКонца = ТекущаяДата();
	ДатаКонца_МС = ТекущаяДата();
	Если ПериодДетализации.Пустая() Тогда
		ПериодДетализации = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя");
	КонецЕсли;
	Если КоличествоПериодов = 0 Тогда
		КоличествоПериодов = 6;
	КонецЕсли;
	Если КоличествоДиаграммНаЭкране = 0 Тогда
		КоличествоДиаграммНаЭкране = 7;
	КонецЕсли;
	
	ПересчитатьПериод(ДатаНачала, ДатаКонца, ПериодДетализации, КоличествоПериодов);
	
	Если Параметры.ЗапуститьИЦО Тогда 
		ПодключитьОбработчикОжидания("ЗапуститьИЦО",0.1,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьИЦО()
	ОбновитьИЦО(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИЦО(Команда)
	Если Организация.Пустая() Тогда
		Предупреждение("Выберите организацию!");
		Возврат;
	КонецЕсли;
	
	Если не (ЗначениеЗаполнено(ДатаНачала) и ЗначениеЗаполнено(ДатаКонца)) Тогда
		Предупреждение("Укажите период!");
		Возврат;
	КонецЕсли;
	
	ПостроитьИЦО();
КонецПроцедуры

&НаКлиенте
Процедура ПолеКоличествоПериодовПриИзменении(Элемент)
	ПересчитатьПериод(ДатаНачала, ДатаКонца, ПериодДетализации, КоличествоПериодов);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьПериод(ДатаНачала, ДатаКонца, ПериодДетализации, КоличествоПериодов)
	текДата = ТекущаяДата();
		
	Если ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День тогда
		ДатаКонца = КонецДня(текДата);
		ДатаНачала = ДатаКонца - 60*60*24 * (КоличествоПериодов-1);
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя  тогда
		НачалоНедели = Константы.ИА_НачалоНедели.Получить();
		Если НачалоНедели > 1 Тогда
			ДатаКонца = КонецНедели(текДата) - (7 - НачалоНедели + 1)*60*60*24;
			Если ДеньНедели(текДата) < НачалоНедели Тогда
				ДатаКонца = ДатаКонца - 60*60*24*7;
			КонецЕсли;
			ДатаНачала = ДатаКонца - 60*60*24*7 * (КоличествоПериодов) + 60*60*24;
		Иначе
			ДатаКонца = КонецНедели(текДата);
			ДатаКонца = ДатаКонца - 60*60*24*7;
			ДатаНачала = НачалоНедели(ДатаКонца) - 60*60*24*7 * (КоличествоПериодов-1);
		КонецЕсли;
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц тогда
		ДатаКонца = КонецМесяца(текДата);
		Если КонецДня(текДата) <> КонецДня(ДатаКонца) Тогда
			ДатаКонца = КонецМесяца(ДобавитьМесяц(НачалоМесяца(текДата),-1));
		КонецЕсли;
		ДатаНачала = НачалоМесяца(ДобавитьМесяц(ДатаКонца, -(КоличествоПериодов-1)));
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Квартал тогда
		ДатаКонца = КонецМесяца(текДата);
		Если КонецДня(текДата) <> КонецДня(ДатаКонца) Тогда
			ДатаКонца = КонецМесяца(ДобавитьМесяц(НачалоМесяца(текДата),-1));
		КонецЕсли;
		ДатаНачала = НачалоМесяца(ДобавитьМесяц(ДатаКонца, -(КоличествоПериодов)*3));
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Год тогда
		ДатаКонца = КонецГода(текДата);
		Если КонецДня(текДата) <> КонецДня(ДатаКонца) Тогда
			ДатаКонца = КонецГода(ДобавитьМесяц(текДата,-12));
		КонецЕсли;
		ДатаНачала = НачалоГода(ДобавитьМесяц(ДатаКонца, -(КоличествоПериодов-1)*12));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеПериодДетализацииПриИзменении(Элемент)
	ПересчитатьПериод(ДатаНачала, ДатаКонца, ПериодДетализации, КоличествоПериодов);
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьИЦО()
	ЗагрузитьСтатистикиИЦОизОргсхемы();
	ОпределитьРазрешениеЭкрана();
	ПостроитьГрафики();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЦвета(пПост)
	ЦветФона = пПост.ЦветФона.Получить();
	Если ЦветФона = Неопределено или (ЦветФона.Красный = 0 и ЦветФона.Зеленый = 0 и ЦветФона.Синий = 0)или (ЦветФона.Красный = -1 и ЦветФона.Зеленый = -1 и ЦветФона.Синий = -1) Тогда
		Возврат "255,255,255";
	Иначе
		Возврат строка(ЦветФона.Красный)+"," + ЦветФона.Зеленый + "," + ЦветФона.Синий;
	КонецЕсли;
КонецФункции

// возвращает текст по всей настройке
&НаСервере
Функция ПолучитьТекстПоляГрафика(Пост,Настройка,ЭтоДепартамент)
	тз = Настройка.статистики.Выгрузить();
	тз.Свернуть("ЗаголовокДиаграммы,ПоказыватьВИЦО");
	Рез = "";
	
	Для каждого стр из ТЗ Цикл
		Если стр.ПоказыватьВИЦО Тогда
			Если Рез<>"" Тогда
				Рез = Рез + "<BR>" + Символы.ПС;
			КонецЕсли;
			
			ТекНомерПоляСтр = 0;
			сч = 1;
			Для каждого стрГрафик из ТаблицаГрафиков Цикл
				Если стрГрафик.Пост = Пост и стрГрафик.ЗаголовокДиаграммы = стр.ЗаголовокДиаграммы Тогда
					ТекНомерПоляСтр = сч;
					Прервать;
				КонецЕсли;
				сч = сч + 1;
			КонецЦикла;
			
			ЗаголовокД = СтрЗаменить(стр.ЗаголовокДиаграммы,"""", "`");
			ТекстБлока = "	<div class=""mainLabelICO"">"+ЗаголовокД+"</div>
							|<div class=""demo-container"" style = ""padding: 3px 3px 3px 3px;"" oncontextmenu=""javascript:document.getElementById('curr_El').innerText = '" + ТекНомерПоляСтр + "';return true;"">
							|<div id=""placeholder"+ТекНомерПоляСтр+""" class=""demo-placeholder""></div>
							|</div>"  + Символы.ПС;
							
			Рез = Рез + ТекстБлока;
			Если ЭтоДепартамент Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ПостроитьГрафики(Пересчитать = истина)
	кол = СтатистикиИЦО.ПолучитьЭлементы().Количество();
	кол = ?(кол = 0,1,кол);
	Проц = Формат(100 / кол, "ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=");;
	
	Если ФормаСтатистик = Неопределено тогда
		ФормаСтатистик = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма",,, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	ТекстОсновной = ПолучитьТекстПоНастройкам(sw, кол, Пересчитать);
	////////////////////////////////////////////////////////////////////////
	
	ТекстСтраницы = "<table border = 0 width = &РазмерТаблицыИЦО& cellpadding = 0 cellspacing=1>
					|<tr align=center valign=top> ";
					
	// ДЕПАРТАМЕНТЫ заголовки
	Для каждого стр из СтатистикиИЦО.ПолучитьЭлементы() Цикл
		ТекстПоднятия = "";
		Если не стр.ПоднятьВверх тогда
			ТекстПоднятия = "<div colspan=2 class='up' width='100%'>&nbsp</div>";
		КонецЕсли;
		стр.ТекстЦвет = ПолучитьТекстЦвета(стр.Пост);
		ТекстСтраницы = ТекстСтраницы + "				
					| <td style='background-color:rgb("+стр.ТекстЦвет+"); width:&РазмерИзобрСтатистики&px;'>"
					+ ТекстПоднятия + "<div><table border=0 width=100% cellpadding=2 cellspacing=0><tr><td align=center valign=middle class='dep' >" 
					+ СтрЗаменить(стр.НаименованиеДляОргсхемы,Символы.ПС, "<br>")+"</td></tr></table></div><br></td>";
	КонецЦикла;
					
	ТекстСтраницы = ТекстСтраницы + "
					|</tr>
					|<tr align=center valign=top> 
					|";

	// Графики статистик отделов					
	счНастроек = 0;
	Пока счНастроек < кол Цикл
		стр = СтатистикиИЦО.ПолучитьЭлементы()[счНастроек];
		
		колОтделов = стр.ПолучитьЭлементы().Количество();
		счОтделов = 0;
		ТекстОтделы = "";
		// по отделам
		Пока счОтделов < колОтделов Цикл
			стрОтдел = стр.ПолучитьЭлементы()[счОтделов];
			Если ЗначениеЗаполнено(стрОтдел.Настройка) Тогда
				ТекстЦвет = ПолучитьТекстЦвета(стрОтдел.Пост);
				ТекстОтделы = ТекстОтделы + "<div style='background-color:rgb("+ТекстЦвет+");'><table border=0 width=100% height=100% cellpadding=0 cellspacing=0><tr><td align=center valign=middle class='otd'>"+СтрЗаменить(стрОтдел.НаименованиеДляОргсхемы,Символы.ПС, "<br>")+"</td></tr></table></div>";
				ТекстОтделы = ТекстОтделы + ПолучитьТекстПоляГрафика(стрОтдел.Пост, стрОтдел.Настройка, стрОтдел.ЭтоДепартамент);
			КонецЕсли;
			
			счОтделов = счОтделов + 1;
		КонецЦикла;
		
		Если ТекстОтделы="" Тогда
			ТекстОтделы = "<div style='width:&РазмерИзобрСтатистики&px;'></div>";
		КонецЕсли;
		
		ТекстСтраницы = ТекстСтраницы + "<td style='background-color:rgb("+стр.ТекстЦвет+");' width=&РазмерИзобрСтатистики&>" + ТекстОтделы + "</td>";
		
		счНастроек = счНастроек + 1;
	КонецЦикла;
	
	ТекстСтраницы = ТекстСтраницы + "
					|</tr>
					|<tr align=center valign=top>";
					
	// графики ДЕПАРТАМЕНТОВ (главные статистики)
	Для каждого стр из СтатистикиИЦО.ПолучитьЭлементы() Цикл		
		ТекстДеп = ПолучитьТекстПоляГрафика(стр.Пост, стр.Настройка, стр.ЭтоДепартамент);
		
		ТекстСтраницы = ТекстСтраницы + "				
					|<td style='background-color:rgb("+стр.ТекстЦвет+"); width:&РазмерИзобрСтатистики&px;'>"+ТекстДеп+"</td>";
	КонецЦикла;
				
	ТекстСтраницы = ТекстСтраницы + "</tr></table><br><div id = ""curr_El"" style=""color:white;""></div>";
					
	РазмерТаблицыИЦО = Формат(кол*РазмерИзобр,"ЧДЦ=0; ЧГ=");
	
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы, "&РазмерТаблицыИЦО&",РазмерТаблицыИЦО);
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы, "&РазмерИзобрСтатистики&",РазмерИзобрСтатистики);
	/// формирование тела закончено
	
	ТекстОсновной = СтрЗаменить(ТекстОсновной,"<1C_body>",ТекстСтраницы);
	//
	
	// запись в файл, вывод
	РезСтраницаИмя = ИА_Статистики_Клиент.ПолучитьФайлСтраницы(ТекстОсновной,"ICO");
	
	НадоОбновить = ДанныеХТМЛ<>"";
	
	ДанныеХТМЛ = РезСтраницаИмя;
	Если НадоОбновить Тогда
		Попытка
			Элементы.ПолеХТМЛ.Документ.parentWindow.location.reload();
		Исключение
			Элементы.ПолеХТМЛ.Документ.window.location.reload();
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстПоНастройкам(ШиринаЭкрана, КоличВСтроке, Пересчитать = Истина)
	
	Если СтатистикиИЦО.ПолучитьЭлементы().Количество() = 0 Тогда
		возврат "";
	КонецЕсли;
	
	ФормаСтатистик.Объект.Настройка = СтатистикиИЦО.ПолучитьЭлементы()[0].Настройка;
	ФормаСтатистик.СписокВыбранныхНастроекСтатистик.Очистить();
	Для каждого Эл Из СтатистикиИЦО.ПолучитьЭлементы() Цикл
		Если ЗначениеЗаполнено(Эл.Настройка) Тогда
	    	НовЭл = ФормаСтатистик.СписокВыбранныхНастроекСтатистик.Добавить();
			НовЭл.Настройка = Эл.Настройка; 
			НовЭл.Пост = Эл.Пост; 
		КонецЕсли;
		Для каждого Эл1 Из Эл.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(Эл1.Настройка) Тогда
				НовЭл = ФормаСтатистик.СписокВыбранныхНастроекСтатистик.Добавить();
				НовЭл.Настройка = Эл1.Настройка; 
				НовЭл.Пост = Эл1.Пост;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОднаНастройка = ФормаСтатистик.СписокВыбранныхНастроекСтатистик.Количество() = 1;
	Если ОднаНастройка Тогда
		ФормаСтатистик.Объект.Настройка = ФормаСтатистик.СписокВыбранныхНастроекСтатистик[0].Настройка;
	КонецЕсли;
	
	Если Пересчитать Тогда
		ФормаСтатистик.ЗагрузитьНастройку(-1,ПериодДетализации,ложь,ложь,истина,истина,истина);
	КонецЕсли;
	
	ФормаСтатистик.Объект.ДатаНачала = ДатаНачала;
	ФормаСтатистик.Объект.ДатаКонца = ДатаКонца;
	
	ФормаСтатистик.Объект.КоличествоВСтроке = мин(КоличествоДиаграммНаЭкране, КоличВСтроке);	
	ФормаСтатистик.sw = ШиринаЭкрана;
	ТекстРез = ФормаСтатистик.СформироватьКартинку(Пересчитать, истина);
	//
	ТаблицаГрафиков.Очистить();
	Для каждого стр из ФормаСтатистик.ДеревоСтатистик.ПолучитьЭлементы() Цикл
		Новстр = ТаблицаГрафиков.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		Если ОднаНастройка Тогда
			Новстр.Пост = ФормаСтатистик.СписокВыбранныхНастроекСтатистик[0].Пост; 
		КонецЕсли;
	КонецЦикла;
	//
	
	РазмерИзобр = ИА_Защита_Статистика.ПолучитьРазмерИзображения(ШиринаЭкрана, мин(КоличествоДиаграммНаЭкране, КоличВСтроке));
	РазмерИзобрСтатистики = Формат(РазмерИзобр, "ЧДЦ=0; ЧГ=");
	
	Возврат ТекстРез;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСтатистикиИЦОизОргсхемы()
	СтатистикиИЦО_с = РеквизитФормыВЗначение("СтатистикиИЦО"); 
	СтатистикиИЦО_с.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка КАК Пост,
	               |	ОргСхема.НастройкаСтатистик КАК Настройка,
	               //|	ОргСхема.ПоднятьВверх,
				   |	ЛОЖЬ КАК ПоднятьВверх,
	               |	ОргСхема.Наименование КАК НаименованиеПоста,
	               //|	ОргСхема.НаименованиеДляОргсхемы,
				   |	ОргСхема.КраткоеНаименование КАК НаименованиеДляОргсхемы,
	               |	ВЫБОР
	               |		КОГДА ОргСхема.ТипТерминала = &Департамент
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоДепартамент
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Ссылка В ИЕРАРХИИ(&Организация)
	               |	И ОргСхема.ТипТерминала = &ТипТерминала
	               |	И НЕ ОргСхема.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОргСхема.ПорядокВСхеме";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипТерминала", Перечисления.ТипТерминалаОргСхемы.Департамент);
	Запрос.УстановитьПараметр("Департамент", Перечисления.ТипТерминалаОргСхемы.Департамент);
	
	ТЗ_Деп = Запрос.Выполнить().Выгрузить();
	Для каждого стрДеп из ТЗ_Деп Цикл
		НовстрДеп = СтатистикиИЦО_с.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НовстрДеп, стрДеп);
		
		Запрос.УстановитьПараметр("Организация", стрДеп.Пост);
		Запрос.УстановитьПараметр("ТипТерминала", Перечисления.ТипТерминалаОргСхемы.Отдел);
		ТЗ_отделы = Запрос.Выполнить().Выгрузить();
		Для каждого стрОтдел из ТЗ_отделы Цикл
			НовстрОтдел = НовстрДеп.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НовстрОтдел, стрОтдел);
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(СтатистикиИЦО_с, "СтатистикиИЦО");
КонецПроцедуры	
	
&НаКлиенте
Процедура ОпределитьРазрешениеЭкрана()	
	swTemp = Элементы.ПолеХТМЛ.Документ.body.clientWidth;
	sw = swTemp;
КонецПроцедуры

&НаКлиенте
Процедура ПолеХТМЛПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// роман
	f=4;
КонецПроцедуры

&НаКлиенте		  
Процедура ПолеКолДиагПриИзменении(Элемент)
	Если СтатистикиИЦО.ПолучитьЭлементы().Количество() = 0 Тогда
		Предупреждение("Сначала постройте статистики!");
		Возврат;
	КонецЕсли;
	ПостроитьГрафики(ложь);
КонецПроцедуры


&НаКлиенте
Процедура ВывестиРасшифровку(Команда)
	номерСтат = Элементы.ПолеХТМЛ.Документ.getElementById("curr_El").innerText;
	Элементы.ПолеХТМЛ.Документ.getElementById("curr_El").innerText = "";
	Если Не ПустаяСтрока(номерСтат) Тогда
		ФормаСтатистик.ВывестиРасшифровку(номерСтат);		
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура перенестиТабДок(приемник, источник)
	приемник.Вывести(источник);
КонецПроцедуры

Функция РазложитьСтрокуВМассивПодстрокЛок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено)
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Функция СтатистикаРучная(ВидСтатистики)
	Возврат ВидСтатистики.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика;
КонецФункции

&НаКлиенте
Процедура ПолеОрганизацияПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВРабочемСтоле(Команда)
	//МассивНомеров = Новый Массив;	
	//СтрокаСтат = ПолучитьТекСтрокуСтат(МассивНомеров);
	//Если СтрокаСтат = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//НомерСтат = число(МассивНомеров[2]);
	//
	//ФормаСтатистик.Объект.Настройка = СтрокаСтат.Настройка;
	//ФормаСтатистик.ЗагрузитьНастройку(НомерСтат);
	//ФормаСтатистик.Объект.ДатаНачала = ДатаНачала;
	//ФормаСтатистик.Объект.ДатаКонца = ДатаКонца;
	//ФормаСтатистик.Объект.КоличествоВСтроке = 3;
	//ФормаСтатистик.sw = sw;
	//ФормаСтатистик.sh = sh;
	//
	//ФормаСтатистик.Открыть();
	//ФормаСтатистик.НарисоватьДиаграммы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ПостРекСовет) Тогда 
		Орг = Параметры.ПостРекСовет; 
		Пока не Орг.Родитель.Пустая() Цикл
			Орг = Орг.Родитель;
		КонецЦикла;
		
		ЭтаФорма.Организация1 = Орг;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	Элементы.Настройки.Пометка = не Элементы.Настройки.Пометка;
	Элементы.ГруппаШапка2.Видимость = Элементы.Настройки.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСтатистику(Команда)
	номерСтат = Элементы.ПолеХТМЛ.Документ.getElementById("curr_El").innerText;
	Элементы.ПолеХТМЛ.Документ.getElementById("curr_El").innerText = "";
	
	Если Не ПустаяСтрока(номерСтат) Тогда
		текНомер = Число(номерСтат)-1;
		
		Ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.Форма",,,истина); 
		Ф.Открыть();
		Ф.Объект.ДатаНачала = ДатаНачала;
		Ф.Объект.ДатаКонца = ДатаКонца;
		Ф.Объект.Настройка = ПолучитьНастройкуПоста(ТаблицаГрафиков[текНомер].Пост);
		Ф.НастройкаПриИзменении(Неопределено);
	Иначе
		Предупреждение("Вывод статистики невозможен для данного элемента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкуПоста(пПост)
	Возврат пПост.НастройкаСтатистик;
КонецФункции
